

#4 проверить относится элемент списка vse к фруктам или овощам используя цикл,

#vse  = [ 'картошка' , 'смородина' , 'яблоки' , 'груши' , 'морковка' , 'лук' , 'помидор' , 'апельсини' , 'арбуз' ]
#ovoshi  = [ 'картошка' , 'морковка' , 'лук' , 'помидор' ]
#frukti  = [ 'яблоки' , 'груши' , 'апельсини' ]

#while True:
   #name=input("Овощ или Фрукты: ")

    #if name in ovoshi:
            #print( name +" " "- это овощ")
    #elif name in frukti:
            #print(name +" " " -это фрукт")
    #elif name in vse:
            #print( name + "- это ягода")
    #else:
            #print('Такой продукт нет в списке')
